In [1]:
import pandas as pd

In [3]:
s1= pd.core.series.Series([1,2,3])
s2= pd.core.series.Series(['one','two','three'])

In [4]:
pd.DataFrame(data= dict(num=s1, word = s2))

   num   word
0    1    one
1    2    two
2    3  three

In [20]:
df= pd.read_csv('friend_list.csv')

In [14]:
df.head()

    name  age      job
0   john   20  student
1  jenny   30  teacher
2   nate   40  dentist
3  brian   45  manager
4  chris   25   intern

In [21]:
df.tail(3) #뒤부터

    name  age        job
3  brian   45    manager
4  chris   25     intern
5  julia   40  developer

In [22]:
df.tail(2)

    name  age        job
4  chris   25     intern
5  julia   40  developer

In [24]:
df= pd.read_csv('friend_list_no head.txt')

In [28]:
df= pd.read_csv('friend_list_no head.txt', header = None)

In [29]:
df

       0   1          2
0   john  20    student
1  jenny  30    teacher
2   nate  40    dentist
3  brian  45    manager
4  chris  25     intern
5  julia  40  developer

In [30]:
df.columns = ['name', 'age', 'job']

In [31]:
df

    name  age        job
0   john   20    student
1  jenny   30    teacher
2   nate   40    dentist
3  brian   45    manager
4  chris   25     intern
5  julia   40  developer

In [33]:
df= pd.read_csv('friend_list_no head.txt', header = None, names = ['name', 'age', 'job'] ) #총 정리하면
df

    name  age        job
0   john   20    student
1  jenny   30    teacher
2   nate   40    dentist
3  brian   45    manager
4  chris   25     intern
5  julia   40  developer